package com.bean;

/**
 * Date:2021/9/6,14:11
 * author:jy
 */
public class AnimalBean {
    public static String[] animalArray = new String[]{
            //动物综合分类： 宠物 哺乳 鸟类 鱼类 爬行 两栖 昆虫 无脊椎

            //宠物

            ////哺乳动物类
            "老虎","狮子","狮子","大象","狼","老鼠","长颈鹿","驯鹿","梅花鹿","大象","貂","猴子","狒狒","斑马","狗","狐狸","斑马"
            ,"熊","熊猫","浣熊","豹子","羚羊","考拉","犀牛","袋鼠","穿山甲","河马","猩猩",""
            ,"海牛","水獭","海豹","海豚","海象","鸭嘴兽","蝙蝠","蚂蚁","山羊","松鼠"
            ,"刺猬","北极熊","鲸鱼","虎鲸","逆戟鲸","小白兔","黄鼠狼","兔子","树懒","",""
            ,"猪","牛","水牛","羊","马","骆驼","兔子","猫","狗","藏獒","驴","骡子","","",""

            ///鸟类
            ,"老鹰","鹰","鹅","企鹅","鹦鹉","啄木鸟","鸵鸟","翠鸟","天鹅","蜂鸟","信天翁","鹤","夜莺","海鸥","孔雀","","","",""
            ,"鸡","公鸡","母鸡","小鸡","鸭子","鹅","火鸡","鸽子","鹌鹑","","","",""
            ,"鸡","鹦鹉","鸽子","乌鸦","麻雀","猫头鹰","企鹅","斑胸草雀","翠鸟","燕子","鸭子","啄木鸟","蜂鸟","狗","火鸡","秃鹫"
            ,"鸵鸟","海鸥","军舰鸟","老鹰","杜鹃","海燕","白颊林莺","非洲灰鹦鹉","画眉","遗鸥","喜鹊","渡渡鸟","小蓝企鹅","戴胜","夜鹭","燕八哥"
            ,"四川短翅莺","啄羊鹦鹉","犀鸟","鸊鷉","震旦鸦雀","伯劳","长耳鸮","小䴙䴘","白胸苦恶鸟","弥曼始今鸟","大雁","侏鸬鹚","白头鹫","红头黑林鸽","猎鹰","小笠原杂色林鸽"
            ,"白腰文鸟","火烈鸟","布谷鸟","小葵花凤头鹦鹉","白颊山雀","栗冠弯嘴鹛","加拿大黑雁","恐鸟","壮丽细尾鹩莺","绿孔雀","椋鸟","旅鸟","留鸟","孔雀","灰雁","蓝极乐鸟"
            ,"日本大山雀","白鹳","红腹灰雀","黄鹂","羞死鸟","红树林树雀","红嘴相思鸟","盔犀鸟"
            ,"母鸡","候鸟","信鸽","红树林树雀","","","","","","","","","","","",""

            //鱼类
            ,"鲨鱼","章鱼","鳄鱼","鲈鱼","鲤鱼","金枪鱼","鲟鱼",""

            ///爬行
            ,"恐龙","蛇","鳄鱼","乌龟","蜥蜴","蟒蛇","变色龙","眼镜蛇","海龟","斑鳖","象龟","壁虎","霸王龙","暴龙","沧龙","奇翼龙"
            ,"绿毛龟","金花蛇","绿鬣蜥","雷龙","穴居沙龟","智利龙","王蛇","甲鱼","中华花龟","果壳綦江龙","刺背鳄蜥","两头蛇","巨颊龙","黄金蟒","鱼龙","","",""

            ///两栖
            ,"海狮","乌龟","蜥蜴","蟾蜍","青蛙","蛇","",""

            ///昆虫
            ,"蝴蝶","蜻蜓","蝎子","珊瑚","纤毛虫","绦虫","肉足虫","吸虫","水蚤","藤壶","蟋蟀","蜈蚣","蝗虫","","","","",""

            //无脊椎
            ,"","","","",""

            ///其他动物  草履虫
            ,"蚯蚓","知了","蝉","恐龙","海蜇","海参","海绵","水母","水螅","海星","乌贼","海葵","海胆","","","","",""
    };
}
