package com.bean;

/**
 * Date:2021/9/6,14:11
 * author:jy
 */
public class AnimalBean {
    public static String[] animalArray = new String[]{
            //动物综合分类： 宠物 哺乳 鸟类 鱼类 爬行 两栖 昆虫 无脊椎

            //宠物
            "狗","猫","蛇","猪","老鼠","鹦鹉","乌龟","兔子","蜥蜴","仓鼠","鸽子","蟒蛇","变色龙","金鱼"
            ,"龙猫","松鼠","刺猬","藏獒","水蛭","信鸽","画眉","泰迪","吉娃娃","土拔鼠","蛔虫","安哥拉兔","苏格兰牧羊犬","家兔","南美洲栗鼠","布偶猫"
            ,"小葵花凤头鹦鹉","金毛","绿毛龟","毛丝鼠","貂","香猪","缅因猫","","","","","","","","","",""
            ////哺乳动物类
                //,"独角鲸" 豆豆返回古诗：《渔歌子》，不要了
            ,"老虎","狮子","狮子","大象","狼","老鼠","长颈鹿","驯鹿","梅花鹿","大象","貂","猴子","狒狒","斑马","狗","狐狸","斑马"
            ,"熊","熊猫","浣熊","豹子","羚羊","考拉","犀牛","袋鼠","穿山甲","河马","猩猩","豹子"
            ,"海牛","水獭","海豹","海豚","海象","鸭嘴兽","蝙蝠","蚂蚁","山羊","松鼠"
            ,"刺猬","北极熊","鲸鱼","虎鲸","逆戟鲸","小白兔","黄鼠狼","兔子","树懒","倭黑猩猩","裸鼹鼠"
            ,"猪","牛","水牛","羊","马","骆驼","兔子","猫","狗","藏獒","驴","骡子","猕猴","白鲸","猎豹"
            ,"山羊","狒狒","高鼻羚羊","豪猪","羚羊","疣猪","棕熊","熊猫","海牛","白犀牛","海象","河狸","蛔虫","逆戟鲸","水牛","长毛象","巨猿","斑马","小熊猫","水獭"
            ,"鬣狗","灰熊","泰迪","吉娃娃","狐猴","豹猫","狨猴","海豹","负鼠","飞猫","犰狳","三趾树懒","龙王鲸","大角羊","日本猕猴","冈比亚鼠","蜜獾","貉"
            ,"藏酋猴","北美负鼠","白兔","东北虎","牙买加稻鼠","黑象鼩","马来貘","赛马","貘","南美洲栗鼠","安第斯眼镜熊","沟齿鼩","北方象海豹","驴","长鼻猴"
            ,"普尔加托里猴","灰鲸","非洲草原象","猫猴","安哥拉兔","苏格兰牧羊","田猫狸","家兔","红颊獴","云猫","斯瓦尔巴驯鹿","亚洲象","羊驼","白足鼠","长须鲸"
            ,"江豚","雕齿兽","野骆驼","斑驴","赤狐","非洲刺毛鼠","侏儒狨","倭河马","黄鼬","蛇獴","角岛鲸","袋獾","香猪","库班猪","红河猪","彩蝠","金毛","卷毛野猪"
            ,"布偶猫","大鼠","大林猪","须猪","鼷鹿","鹿豚","毛丝鼠","袋狮","吸血蝙蝠","旅鼠","袋狼","缅因猫","","","","","","",""
            ,"","","","","","","","","","","","","","","","","","",""

            ///鸟类
            ,"老鹰","鹰","鹅","企鹅","鹦鹉","啄木鸟","鸵鸟","翠鸟","天鹅","蜂鸟","信天翁","鹤","夜莺","海鸥","孔雀","","","",""
            ,"鸡","公鸡","母鸡","小鸡","鸭子","鹅","火鸡","鸽子","鹌鹑","","","",""
            ,"鸡","鹦鹉","鸽子","乌鸦","麻雀","猫头鹰","企鹅","斑胸草雀","翠鸟","燕子","鸭子","啄木鸟","蜂鸟","狗","火鸡","秃鹫"
            ,"鸵鸟","海鸥","军舰鸟","老鹰","杜鹃","海燕","白颊林莺","非洲灰鹦鹉","画眉","遗鸥","喜鹊","渡渡鸟","小蓝企鹅","戴胜","夜鹭","燕八哥"
            ,"四川短翅莺","啄羊鹦鹉","犀鸟","鸊鷉","震旦鸦雀","伯劳","长耳鸮","小䴙䴘","白胸苦恶鸟","弥曼始今鸟","大雁","侏鸬鹚","白头鹫","红头黑林鸽","猎鹰","小笠原杂色林鸽"
            ,"白腰文鸟","火烈鸟","布谷鸟","小葵花凤头鹦鹉","白颊山雀","栗冠弯嘴鹛","加拿大黑雁","恐鸟","壮丽细尾鹩莺","绿孔雀","椋鸟","旅鸟","留鸟","孔雀","灰雁","蓝极乐鸟"
            ,"日本大山雀","白鹳","红腹灰雀","黄鹂","羞死鸟","红树林树雀","红嘴相思鸟","盔犀鸟"
            ,"母鸡","候鸟","信鸽","红树林树雀","","","","","","","","","","","",""

            //鱼类
            ,"鲨鱼","章鱼","鳄鱼","鲈鱼","鲤鱼","金枪鱼","鲟鱼"
            ,"鲨鱼","金鱼","食人鱼","海马","电鳗","河豚","中华鲟","锯鳐","非洲肺鱼","三文鱼","美人鱼","孔雀鱼","月鱼"
            ,"秋刀鱼","鲶鱼","锤头鲨","翻车鱼","弹涂鱼","淡水鱼","草鱼","金龙鱼" ,"杜兹肺鱼","射水鱼","六须鲶鱼","娃娃鱼"
            ,"魟鱼","双髻鲨","多鳍鱼","泥鳅","假鳃鳉鱼","大银鱼","大鲵","查菲窄尾魟","口袋鲨","观赏鱼","水滴鱼","鮟鱇" ,"鳕鱼"
            ,"沙丁鱼","垩鮨","小丑鱼","刀鱼","蝠鲼","壶瓶山鮡","条纹斑竹鲨","切蛋鱼","鳄雀鳝","前口蝠鲼","豹纹鲨","虾虎鱼","云斑尖嘴丽鱼"
            ,"大白鲨","虾","腔棘鱼",""

            ///爬行
            ,"恐龙","蛇","鳄鱼","乌龟","蜥蜴","蟒蛇","变色龙","眼镜蛇","海龟","斑鳖","象龟","壁虎","霸王龙","暴龙","沧龙","奇翼龙"
            ,"绿毛龟","金花蛇","绿鬣蜥","雷龙","穴居沙龟","智利龙","王蛇","甲鱼","中华花龟","果壳綦江龙","刺背鳄蜥","两头蛇","巨颊龙","黄金蟒","鱼龙","","",""

            ///两栖
            ,"海狮","乌龟","蜥蜴","蟾蜍","青蛙","蛇","青蛙","斑鳖","海蟾蜍" ,"蟾蜍","蝾螈","蝌蚪","红点齿蟾","牛蛙","透明鱼"
            ,"变形蛙","新疆北鲵","阿马乌童蛙","玻璃蛙","树蛙","魔鬼蛙","墨西哥钝口螈","蚓螈","山鸡细趾蟾","伊比利亚山蛙"
            ,"越南棱皮树蛙","角蛙","黄金箭毒蛙","奇异多指节蛙","","",""

            ///昆虫
            ,"蝴蝶","蜻蜓","蝎子","珊瑚","纤毛虫","绦虫","肉足虫","吸虫","水蚤","藤壶","蟋蟀","蜈蚣","蝗虫"
            ,"蚊子","蚂蚁","蜜蜂","蟑螂","蝉","苍蝇","蝴蝶","萤火虫","蜻蜓","果蝇","蚕","螳螂","屎壳郎","蟋蟀","白蚁","冬虫夏草"
            ,"飞蛾","金蝉","跳蚤","臭虫","切叶蚁","蚜虫","大黄蜂","虱子","虎头蜂","兰花螳螂","灶马","螳水蝇","旌蛉","枯叶蝴蝶","蚊蝎蛉"
            ,"复变甲","弓背蚁","椿象","滑翔蚁","埋葬虫","竹节虫","草蛉","巨脉蜻蜓","阴虱","麦蚜","放屁虫","美洲蜚蠊","","","","","",""

            //无脊椎
            ,"蚊子","蚂蚁","蜘蛛","蜜蜂","蟑螂","章鱼","蝉","苍蝇","蝴蝶","蝴蝶","蜗牛","萤火虫"
            ,"蜻蜓","龙虾","水母","果蝇","蚯蚓","蚕","螃蟹","螳螂","蜈蚣","乌贼","蟋蟀","蝎子","屎壳郎","螳螂虾","仙女虾","水熊虫","白蚁","鱿鱼","飞蛾","知了","牡蛎"
            ,"金蝉","螨虫","冬虫夏草","蛞蝓","鲎","鹦鹉螺","珊瑚","狼蛛","跳蚤","虎头蜂","海星","海参","水熊","大黄蜂","蜘蛛蟹","磷虾","象拔蚌","织纹螺","珊瑚鳌虾"
            ,"臭虫","砗磲","大王具足虫","切叶蚁","捕鱼蛛","蚜虫","栉水母","虱子","扇贝","毛毛虫","海绵","水螅","凤蝶","吸血虫","射炮步甲","弓形虫","蜚蠊","巨脉蜻蜓"
            ,"灶马","突灶螽","帆水母","地中海实蝇","复变甲","旌蛉","蚊蝎蛉","螳水蝇","钩翅石蛾" ,"隐尾蠊","褐飞虱","吸血鬼蟹","孔雀跳蛛","线虫","大蚁蛛","太平洋潜泥蛤"
            ,"滑翔蚁","桶水母","盲蛛","寇蛛","草蛉","银背艾蛛"
            ,"弓背蚁","海蜘蛛","阴虱","蛾子","椿象","壁蜂","阿根廷蚂蚁","乌桕大蚕蛾" ,"竹节虫","贻贝","面象虫","巨型蜘蛛蟹","跳蛛","埋葬虫","齿猛蚁","陷阱颚蚁"
            ,"颚口线虫","鼓虾","麦蚜","纽虫","沙漠穹蛛","冰海精灵","秋麒麟蟹蛛","放屁虫" ,"火体虫","食骨蠕虫","","","","","",""

            ///其他动物  草履虫
            ,"蚯蚓","知了","蝉","恐龙","海蜇","海参","海绵","水母","水螅","海星","乌贼","海葵","海胆","","","","",""
    };
}
